## Importing library

In [1]:
library(car)

Loading required package: carData

In [2]:
home_dir = normalizePath("~")
relative_path = file.path("R programs")
full_path = file.path(home_dir, relative_path)
full_path

[1] "C:\\Users\\Anil\\Documents/R programs"

In [3]:
setwd(full_path)

## For some NA values Opening OIL csv
data = read.csv("Data/store-forecasting/oil.csv")
dim(data)

brief(data)
### head
head(data)
### Send more data using head .csv
head(data, 8)

### Checking Column names
colnames(data)
### Changing Columns names
colnames(data)[2] = "idk"
colnames(data)[1:2]  = c("date", "dcoilwtico")
colnames(data)
### Cleaning Observations
X = c(0,NA,2 ,3,4,-0.5)
!is.na(NA) 
X>2 & !is.na(X)
is.nan(0/0)
is.infinite(1/0)


data_1 = data
data_1[1000,1] = NA
data_1[1000,2] = NA

[1] 1218    2

1218 x 2 data.frame (1213 rows omitted)
           date dcoilwtico
            [c]        [n]
1    2013-01-01         NA
2    2013-01-02      93.14
3    2013-01-03      92.97
. . .
1217 2017-08-30      45.96
1218 2017-08-31      47.26

  date       dcoilwtico
1 2013-01-01    NA
2 2013-01-02 93.14
3 2013-01-03 92.97
4 2013-01-04 93.12
5 2013-01-07 93.20
6 2013-01-08 93.21

  date       dcoilwtico
1 2013-01-01    NA
2 2013-01-02 93.14
3 2013-01-03 92.97
4 2013-01-04 93.12
5 2013-01-07 93.20
6 2013-01-08 93.21
7 2013-01-09 93.08
8 2013-01-10 93.81

[1] "date"       "dcoilwtico"

[1] "date"       "dcoilwtico"

[1] FALSE

[1] FALSE FALSE FALSE  TRUE  TRUE FALSE

[1] TRUE

[1] TRUE

* Summing all the NA obervation after creating em

In [4]:
sum(is.na(data_1))
### Checking vs originnal data
sum(is.na(data))
### replacing all the an observations with zero
sum(is.na((na.omit(data_1))))

[1] 45

[1] 43

[1] 0

In [5]:
head(Freedman)

            population nonwhite density crime
Akron        675        7.3      746    2602
Albany       713        2.6      322    1388
Albuquerque   NA        3.3       NA    5018
Allentown    534        0.8      491    1182
Anaheim     1261        1.4     1612    3341
Atlanta     1330       22.8      770    2805

In [6]:
DF = data.frame(a = c(NA, 1, 2), b = c("one", NA, "three"))
DF
subset(DF, !is.na(a))
subset(DF, !is.na(b))
subset(DF,complete.cases(DF))
na.omit(DF)

  a  b
1 NA one
2  1 NA
3  2 three

  a b
2 1 NA
3 2 three

  a  b
1 NA one
3  2 three

  a b
3 2 three

  a b
3 2 three

In [7]:
head(Freedman)
str(Freedman)
summary(Freedman)

            population nonwhite density crime
Akron        675        7.3      746    2602
Albany       713        2.6      322    1388
Albuquerque   NA        3.3       NA    5018
Allentown    534        0.8      491    1182
Anaheim     1261        1.4     1612    3341
Atlanta     1330       22.8      770    2805

'data.frame':	110 obs. of  4 variables:
 $ population: int  675 713 NA 534 1261 1330 331 1981 315 305 ...
 $ nonwhite  : num  7.3 2.6 3.3 0.8 1.4 22.8 7 21.6 20.7 0.6 ...
 $ density   : int  746 322 NA 491 1612 770 41 877 240 147 ...
 $ crime     : int  2602 1388 5018 1182 3341 2805 3306 4256 2117 1063 ...

   population         nonwhite        density            crime
 Min.   :  270.0   Min.   : 0.30   Min.   :   37.0   Min.   : 458
 1st Qu.:  398.8   1st Qu.: 3.40   1st Qu.:  266.5   1st Qu.:2067
 Median :  664.0   Median : 7.20   Median :  412.0   Median :2698
 Mean   : 1136.0   Mean   :10.80   Mean   :  765.7   Mean   :2714
 3rd Qu.: 1167.8   3rd Qu.:14.88   3rd Qu.:  773.2   3rd Qu.:3305
 Max.   :11551.0   Max.   :64.30   Max.   :13087.0   Max.   :5441
 NA's   :10                        NA's   :10

* Below is the example of median function throwing NA becoz of NA values being present
* "**$**" sign is used to access column in a Dataframe

In [8]:
median(Freedman$density)

[1] NA

* Treating the NA error by removing the na values

In [9]:
median(Freedman$density, na.rm = T)

[1] 412

* Doing same with mean

In [10]:
mean(Freedman$density)
mean(Freedman$density,na.rm = T)

[1] NA

[1] 765.67

In [11]:
### Rows of Data are removed which means a obervation has NA in column the entire observartion is removed using na.omit
Freedman.good = na.omit(Freedman)   
summary(Freedman.good)

   population         nonwhite        density            crime
 Min.   :  270.0   Min.   : 0.30   Min.   :   37.0   Min.   : 458
 1st Qu.:  398.8   1st Qu.: 3.40   1st Qu.:  266.5   1st Qu.:2100
 Median :  664.0   Median : 7.30   Median :  412.0   Median :2762
 Mean   : 1136.0   Mean   :10.66   Mean   :  765.7   Mean   :2733
 3rd Qu.: 1167.8   3rd Qu.:14.82   3rd Qu.:  773.2   3rd Qu.:3318
 Max.   :11551.0   Max.   :64.30   Max.   :13087.0   Max.   :5441

In [12]:
Freedman_notav = Freedman[!complete.cases(Freedman),]
Freedman_notav

                population nonwhite density crime
Albuquerque     NA          3.3     NA      5018
Charleston.SC   NA         38.5     NA      2482
Charleston.W.VA NA          5.8     NA      1434
Columbia        NA         29.0     NA      2884
Des.Moines      NA          4.1     NA      2415
Erie            NA          2.8     NA      1181
Greenville      NA         16.3     NA      2602
Huntington      NA          3.0     NA      1413
trenton         NA         12.9     NA      3098
Tucson          NA          6.3     NA      2705

### "Using R" Library

In [13]:
library(UsingR)
x = babies$dwt
summary(x)
x[x==999]= NA
range(x)
summary(x)
range(x, na.rm = T)

Loading required package: MASS

Loading required package: HistData

Loading required package: Hmisc


Attaching package: 'Hmisc'


The following objects are masked from 'package:base':

    format.pval, units

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.
  110.0   165.0   190.0   505.4   999.0   999.0

[1] NA NA

   Min. 1st Qu.  Median    Mean 3rd Qu.    Max.    NA's
  110.0   155.0   170.0   171.2   185.0   260.0     499

[1] 110 260

### Remvoal of non unique values

In [14]:
## Reusing the data created above (it hall all unique columns)
head(data)
data_2 =data
dim(data_2)
data_3  = rbind.data.frame(data_2, data[1:500, ])
dim(data_3)

  date       dcoilwtico
1 2013-01-01    NA
2 2013-01-02 93.14
3 2013-01-03 92.97
4 2013-01-04 93.12
5 2013-01-07 93.20
6 2013-01-08 93.21

[1] 1218    2

[1] 1718    2

In [15]:
data_4 = unique(data_3)
dim(data_4) ## only unique values got copied

[1] 1218    2

## Handling DataFrames

### Selection of Coumns and rows

In [16]:
head(iris)
iris[,3]
head(iris[,3])

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species
1 5.1          3.5         1.4          0.2         setosa
2 4.9          3.0         1.4          0.2         setosa
3 4.7          3.2         1.3          0.2         setosa
4 4.6          3.1         1.5          0.2         setosa
5 5.0          3.6         1.4          0.2         setosa
6 5.4          3.9         1.7          0.4         setosa

  [1] 1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 1.5 1.6 1.4 1.1 1.2 1.5 1.3 1.4
 [19] 1.7 1.5 1.7 1.5 1.0 1.7 1.9 1.6 1.6 1.5 1.4 1.6 1.6 1.5 1.5 1.4 1.5 1.2
 [37] 1.3 1.4 1.3 1.5 1.3 1.3 1.3 1.6 1.9 1.4 1.6 1.4 1.5 1.4 4.7 4.5 4.9 4.0
 [55] 4.6 4.5 4.7 3.3 4.6 3.9 3.5 4.2 4.0 4.7 3.6 4.4 4.5 4.1 4.5 3.9 4.8 4.0
 [73] 4.9 4.7 4.3 4.4 4.8 5.0 4.5 3.5 3.8 3.7 3.9 5.1 4.5 4.5 4.7 4.4 4.1 4.0
 [91] 4.4 4.6 4.0 3.3 4.2 4.2 4.2 4.3 3.0 4.1 6.0 5.1 5.9 5.6 5.8 6.6 4.5 6.3
[109] 5.8 6.1 5.1 5.3 5.5 5.0 5.1 5.3 5.5 6.7 6.9 5.0 5.7 4.9 6.7 4.9 5.7 6.0
[127] 4.8 4.9 5.6 5.8 6.1 6.4 5.6 5.1 5.6 6.1 5.6 5.5 4.8 5.4 5.6 5.1 5.1 5.9
[145] 5.7 5.2 5.0 5.2 5.4 5.1

[1] 1.4 1.4 1.3 1.5 1.4 1.7

* Extracting specific columns (here  3 and 5)
* Extracting specific rows
* EXtract using column names

In [17]:
head(iris[, c(3,5)])
iris[c(4:10), c(3:5)]
head(iris[, c("Species", "Petal.Length")])

  Petal.Length Species
1 1.4          setosa
2 1.4          setosa
3 1.3          setosa
4 1.5          setosa
5 1.4          setosa
6 1.7          setosa

   Petal.Length Petal.Width Species
4  1.5          0.2         setosa
5  1.4          0.2         setosa
6  1.7          0.4         setosa
7  1.4          0.3         setosa
8  1.5          0.2         setosa
9  1.4          0.2         setosa
10 1.5          0.1         setosa

  Species Petal.Length
1 setosa  1.4
2 setosa  1.4
3 setosa  1.3
4 setosa  1.5
5 setosa  1.4
6 setosa  1.7

### Creation of new variables in a DataFrame

In [18]:
iris$Petal.Ratio = iris$Petal.Length / iris$Petal.Width
iris$Sepal.Ratio = iris$Sepal.Length / iris$Sepal.Width
head(iris)

  Sepal.Length Sepal.Width Petal.Length Petal.Width Species Petal.Ratio
1 5.1          3.5         1.4          0.2         setosa  7.00
2 4.9          3.0         1.4          0.2         setosa  7.00
3 4.7          3.2         1.3          0.2         setosa  6.50
4 4.6          3.1         1.5          0.2         setosa  7.50
5 5.0          3.6         1.4          0.2         setosa  7.00
6 5.4          3.9         1.7          0.4         setosa  4.25
  Sepal.Ratio
1 1.457143
2 1.633333
3 1.468750
4 1.483871
5 1.388889
6 1.384615

### Extracting Observations and summarizing them
**Extracting**
1. Direct Method
2. Using subset

**Summarizing**
1. brief
2. summary
3. str    (means Structure)
4. summarise (Requires Library:- dplyr)

In [19]:
iris[iris$Petal.Width>0.5 & iris$Species== "setosa",]
subset(iris,Petal.Width>0.5 & Species == "setosa")

   Sepal.Length Sepal.Width Petal.Length Petal.Width Species Petal.Ratio
44 5            3.5         1.6          0.6         setosa  2.666667
   Sepal.Ratio
44 1.428571

   Sepal.Length Sepal.Width Petal.Length Petal.Width Species Petal.Ratio
44 5            3.5         1.6          0.6         setosa  2.666667
   Sepal.Ratio
44 1.428571

In [20]:
library(dplyr)
summary(iris)
str(iris)
brief(iris)
summarise(iris,Petal.Length =   mean(Petal.Length),
            ,Sepal.Length =   mean(Sepal.Length)
            ,Petal.Width = mean(Petal.Width)
            ,Sepal.width =   mean(Sepal.Width))

Attaching package: 'dplyr'


The following objects are masked from 'package:Hmisc':

    src, summarize


The following object is masked from 'package:MASS':

    select


The following object is masked from 'package:car':

    recode


The following objects are masked from 'package:stats':

    filter, lag


The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

  Sepal.Length    Sepal.Width     Petal.Length    Petal.Width
 Min.   :4.300   Min.   :2.000   Min.   :1.000   Min.   :0.100
 1st Qu.:5.100   1st Qu.:2.800   1st Qu.:1.600   1st Qu.:0.300
 Median :5.800   Median :3.000   Median :4.350   Median :1.300
 Mean   :5.843   Mean   :3.057   Mean   :3.758   Mean   :1.199
 3rd Qu.:6.400   3rd Qu.:3.300   3rd Qu.:5.100   3rd Qu.:1.800
 Max.   :7.900   Max.   :4.400   Max.   :6.900   Max.   :2.500
       Species    Petal.Ratio      Sepal.Ratio
 setosa    :50   Min.   : 2.125   Min.   :1.268
 versicolor:50   1st Qu.: 2.802   1st Qu.:1.546
 virginica :50   Median : 3.300   Median :2.032
                 Mean   : 4.311   Mean   :1.954
                 3rd Qu.: 4.667   3rd Qu.:2.225
                 Max.   :15.000   Max.   :2.962

'data.frame':	150 obs. of  7 variables:
 $ Sepal.Length: num  5.1 4.9 4.7 4.6 5 5.4 4.6 5 4.4 4.9 ...
 $ Sepal.Width : num  3.5 3 3.2 3.1 3.6 3.9 3.4 3.4 2.9 3.1 ...
 $ Petal.Length: num  1.4 1.4 1.3 1.5 1.4 1.7 1.4 1.5 1.4 1.5 ...
 $ Petal.Width : num  0.2 0.2 0.2 0.2 0.2 0.4 0.3 0.2 0.2 0.1 ...
 $ Species     : Factor w/ 3 levels "setosa","versicolor",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ Petal.Ratio : num  7 7 6.5 7.5 7 ...
 $ Sepal.Ratio : num  1.46 1.63 1.47 1.48 1.39 ...
150 x 7 data.frame (145 rows and 2 columns omitted)
    Sepal.Length Sepal.Width Petal.Length . . . Petal.Ratio Sepal.Ratio
             [n]         [n]          [n]               [n]         [n]
1            5.1         3.5          1.4          7.000000    1.457143
2            4.9         3.0          1.4          7.000000    1.633333
3            4.7         3.2          1.3          6.500000    1.468750
. . .
149          6.2         3.4          5.4          2.347826    1.823529
150          5.9         3.0          5.1          2.833333    1.966667

  Petal.Length Sepal.Length Petal.Width Sepal.width
1 3.758        5.843333     1.199333    3.057333

### Working with DataFrames

In [21]:
library(car)
dim(Davis)
head(Davis)
output = data.frame(matrix(nrow = dim(Davis)[1], ncol = dim(Davis)[2]))
colnames(output) = c("Gender", "Wt", "Ht", "Repwt", "Repht")
dim(output)
head(output)

[1] 200   5

  sex weight height repwt repht
1 M   77     182    77    180
2 F   58     161    51    159
3 F   53     161    54    158
4 M   68     177    70    175
5 F   59     157    59    155
6 M   76     170    76    165

[1] 200   5

  Gender Wt Ht Repwt Repht
1 NA     NA NA NA    NA
2 NA     NA NA NA    NA
3 NA     NA NA NA    NA
4 NA     NA NA NA    NA
5 NA     NA NA NA    NA
6 NA     NA NA NA    NA

In [22]:
output$Gender = Davis$sex
output$Wt  = Davis$weight
output$Ht = Davis$height
output$Repwt = Davis$repwt
output$Repht = Davis$repht 
head(output)

  Gender Wt Ht  Repwt Repht
1 M      77 182 77    180
2 F      58 161 51    159
3 F      53 161 54    158
4 M      68 177 70    175
5 F      59 157 59    155
6 M      76 170 76    165

### Working with *Factor* Variables
**Factor** Variables are used to work with Categorical variables in DataFrame
* Levels are the unique values that a factor can take

In [23]:
library(UsingR)
head(Cars93)
d = Cars93[1:3,1:4]
summary(d)

  Manufacturer Model   Type    Min.Price Price Max.Price MPG.city MPG.highway
1 Acura        Integra Small   12.9      15.9  18.8      25       31
2 Acura        Legend  Midsize 29.2      33.9  38.7      18       25
3 Audi         90      Compact 25.9      29.1  32.3      20       26
4 Audi         100     Midsize 30.8      37.7  44.6      19       26
5 BMW          535i    Midsize 23.7      30.0  36.2      22       30
6 Buick        Century Midsize 14.2      15.7  17.3      22       31
  AirBags            DriveTrain ⋯ Passengers Length Wheelbase Width Turn.circle
1 None               Front      ⋯ 5          177    102       68    37
2 Driver & Passenger Front      ⋯ 5          195    115       71    38
3 Driver only        Front      ⋯ 5          180    102       67    37
4 Driver & Passenger Front      ⋯ 6          193    106       70    37
5 Driver only        Rear       ⋯ 4          186    109       69    39
6 Driver only        Front      ⋯ 6          189    105       69    41
  Rear.seat.room Luggage.room Weight Origin  Make
1 26.5           11           2705   non-USA Acura Integra
2 30.0           15           3560   non-USA Acura Legend
3 28.0           14           3375   non-USA Audi 90
4 31.0           17           3405   non-USA Audi 100
5 27.0           13           3640   non-USA BMW 535i
6 28.0           16           2880   USA     Buick Century

    Manufacturer     Model        Type     Min.Price
 Acura    :2     90     :1   Compact:1   Min.   :12.90
 Audi     :1     Integra:1   Large  :0   1st Qu.:19.40
 BMW      :0     Legend :1   Midsize:1   Median :25.90
 Buick    :0     100    :0   Small  :1   Mean   :22.67
 Cadillac :0     190E   :0   Sporty :0   3rd Qu.:27.55
 Chevrolet:0     240    :0   Van    :0   Max.   :29.20
 (Other)  :0     (Other):0

In [24]:
d[3,4] = NA
d[1,1] = NA
d[3,c(2,4)] = list("A3", 40) ## NA values will be generated because the dataframe has levels
d
class(d$Model) ## it is a factor module

levels(d$Model)
## Dropping the Levels which are not used
d$Model = droplevels(d$Model)
levels(d$Model) = c(levels(d$Model) , c("A3", "A4", "A6"))
levels(d$Model)

Warning message in `[<-.factor`(`*tmp*`, iseq, value = "A3"):
"invalid factor level, NA generated"

  Manufacturer Model   Type    Min.Price
1 NA           Integra Small   12.9
2 Acura        Legend  Midsize 29.2
3 Audi         NA      Compact 40.0

[1] "factor"

 [1] "100"            "190E"           "240"            "300E"
 [5] "323"            "535i"           "626"            "850"
 [9] "90"             "900"            "Accord"         "Achieva"
[13] "Aerostar"       "Altima"         "Astro"          "Bonneville"
[17] "Camaro"         "Camry"          "Capri"          "Caprice"
[21] "Caravan"        "Cavalier"       "Celica"         "Century"
[25] "Civic"          "Colt"           "Concorde"       "Continental"
[29] "Corrado"        "Corsica"        "Corvette"       "Cougar"
[33] "Crown_Victoria" "Cutlass_Ciera"  "DeVille"        "Diamante"
[37] "Dynasty"        "ES300"          "Eighty-Eight"   "Elantra"
[41] "Escort"         "Eurovan"        "Excel"          "Festiva"
[45] "Firebird"       "Fox"            "Grand_Prix"     "Imperial"
[49] "Integra"        "Justy"          "Laser"          "LeBaron"
[53] "LeMans"         "LeSabre"        "Legacy"         "Legend"
[57] "Loyale"         "Lumina"         "Lumina_APV"     "MPV"
[61] "Maxima"         "Metro"          "Mirage"         "Mustang"
[65] "Passat"         "Prelude"        "Previa"         "Probe"
[69] "Protege"        "Q45"            "Quest"          "RX-7"
[73] "Riviera"        "Roadmaster"     "SC300"          "SL"
[77] "Scoupe"         "Sentra"         "Seville"        "Shadow"
[81] "Silhouette"     "Sonata"         "Spirit"         "Stealth"
[85] "Storm"          "Summit"         "Sunbird"        "Swift"
[89] "Taurus"         "Tempo"          "Tercel"         "Town_Car"
[93] "Vision"

[1] "Integra" "Legend"  "A3"      "A4"      "A6"

In [25]:
d[3,c(2,4)] = list("A3", 40)
d[4,] = list("Audi", "A4", "Midsize", 35) ## A row was added
d
d= rbind(d,list("Audi", "A4", "Midsize", 35)) ## A row was added 
d

  Manufacturer Model   Type    Min.Price
1 NA           Integra Small   12.9
2 Acura        Legend  Midsize 29.2
3 Audi         A3      Compact 40.0
4 Audi         A4      Midsize 35.0

  Manufacturer Model   Type    Min.Price
1 NA           Integra Small   12.9
2 Acura        Legend  Midsize 29.2
3 Audi         A3      Compact 40.0
4 Audi         A4      Midsize 35.0
5 Audi         A4      Midsize 35.0

In [26]:
d[,5] = d$Min.Price*3 ## Adding a new column with 3 times the price
d
colnames(d)[5] = "modprice"

  Manufacturer Model   Type    Min.Price V5
1 NA           Integra Small   12.9       38.7
2 Acura        Legend  Midsize 29.2       87.6
3 Audi         A3      Compact 40.0      120.0
4 Audi         A4      Midsize 35.0      105.0
5 Audi         A4      Midsize 35.0      105.0

* Directly adding a column

In [27]:
## Another method to add column
d$modprice = d$Min.Price * 3
d

  Manufacturer Model   Type    Min.Price modprice
1 NA           Integra Small   12.9       38.7
2 Acura        Legend  Midsize 29.2       87.6
3 Audi         A3      Compact 40.0      120.0
4 Audi         A4      Midsize 35.0      105.0
5 Audi         A4      Midsize 35.0      105.0

* Adding using *within* method

In [28]:
d = within(d, {modprice = Min.Price*3})
d

  Manufacturer Model   Type    Min.Price modprice
1 NA           Integra Small   12.9       38.7
2 Acura        Legend  Midsize 29.2       87.6
3 Audi         A3      Compact 40.0      120.0
4 Audi         A4      Midsize 35.0      105.0
5 Audi         A4      Midsize 35.0      105.0

## Transforming Dataframe across Long and Wide Formats
* Using library *reshape2*

In [32]:
Speed.1 <- c(850, 740, 1070, 568, 960, 870)
Speed.2 <- c(960, 610, 360, 405, 779, 145)
Speed.3 <- c(890, 720, 1100, 580, 950, 880)
Speed.4 <- c(920, 630, 370, 415, 800, 150)
Speed.5 <- c(860, 750, 1080, 570, 970, 890)
Speed.6 <- c(930, 620, 380, 400, 810, 155)
id = c(1,2,3,4,5,6)
Run = c("A", "B", "C", "D", "E","F")
Speed = cbind.data.frame(id, Run, Speed.1,Speed.2,Speed.3,Speed.4,Speed.5,Speed.6)
head(Speed)
summary(Speed)

  id Run Speed.1 Speed.2 Speed.3 Speed.4 Speed.5 Speed.6
1 1  A    850    960      890    920      860    930
2 2  B    740    610      720    630      750    620
3 3  C   1070    360     1100    370     1080    380
4 4  D    568    405      580    415      570    400
5 5  E    960    779      950    800      970    810
6 6  F    870    145      880    150      890    155

       id           Run               Speed.1          Speed.2
 Min.   :1.00   Length:6           Min.   : 568.0   Min.   :145.0
 1st Qu.:2.25   Class :character   1st Qu.: 767.5   1st Qu.:371.2
 Median :3.50   Mode  :character   Median : 860.0   Median :507.5
 Mean   :3.50                      Mean   : 843.0   Mean   :543.2
 3rd Qu.:4.75                      3rd Qu.: 937.5   3rd Qu.:736.8
 Max.   :6.00                      Max.   :1070.0   Max.   :960.0
    Speed.3          Speed.4         Speed.5          Speed.6
 Min.   : 580.0   Min.   :150.0   Min.   : 570.0   Min.   :155.0
 1st Qu.: 760.0   1st Qu.:381.2   1st Qu.: 777.5   1st Qu.:385.0
 Median : 885.0   Median :522.5   Median : 875.0   Median :510.0
 Mean   : 853.3   Mean   :547.5   Mean   : 853.3   Mean   :549.2
 3rd Qu.: 935.0   3rd Qu.:757.5   3rd Qu.: 950.0   3rd Qu.:762.5
 Max.   :1100.0   Max.   :920.0   Max.   :1080.0   Max.   :930.0

In [34]:
library(reshape2)
long = melt(Speed , id.vars = names(Speed)[1:2], variable.name = "Speed")
head(long)

  id Run Speed   value
1 1  A   Speed.1  850
2 2  B   Speed.1  740
3 3  C   Speed.1 1070
4 4  D   Speed.1  568
5 5  E   Speed.1  960
6 6  F   Speed.1  870

In [35]:
wide = dcast(long , id+Run ~Speed)
head(wide)

  id Run Speed.1 Speed.2 Speed.3 Speed.4 Speed.5 Speed.6
1 1  A    850    960      890    920      860    930
2 2  B    740    610      720    630      750    620
3 3  C   1070    360     1100    370     1080    380
4 4  D    568    405      580    415      570    400
5 5  E    960    779      950    800      970    810
6 6  F    870    145      880    150      890    155

### Merging DataFrames

In [36]:
v1  = c("The Avengers", "Dark Knight", "Hunger Games", "Skyfall" , "Hobbit")
v2 = c(124345 , 2353454 , 3453534 , 2353456456, 2353456456)
domestic = cbind.data.frame(v1, v2)
head(domestic)

  v1           v2
1 The Avengers     124345
2 Dark Knight     2353454
3 Hunger Games    3453534
4 Skyfall      2353456456
5 Hobbit       2353456456

In [37]:
colnames(domestic) = c("Name", "Domestic")
head(domestic)

  Name         Domestic
1 The Avengers     124345
2 Dark Knight     2353454
3 Hunger Games    3453534
4 Skyfall      2353456456
5 Hobbit       2353456456

In [39]:
v3  = c("The Avengers", "Dark Knight", "Ice age", "Skyfall" , "Hobbit")
v4 = c(124345 , 2353454 , 3453534 , 2353456456, 2353456456)
foreign  = cbind.data.frame(v3,v4)
head(foreign)
colnames(foreign) = c("name" , "foreign")
head(foreign)

  v3           v4
1 The Avengers     124345
2 Dark Knight     2353454
3 Ice age         3453534
4 Skyfall      2353456456
5 Hobbit       2353456456

  name         foreign
1 The Avengers     124345
2 Dark Knight     2353454
3 Ice age         3453534
4 Skyfall      2353456456
5 Hobbit       2353456456

* Merge is like intersection or *inner* merge

In [40]:
### Performing Merge to merge basis on columns
Final = merge(domestic , foreign  , by.x = "Name", by.y = "name")
head(Final)

  Name         Domestic   foreign
1 Dark Knight     2353454    2353454
2 Hobbit       2353456456 2353456456
3 Skyfall      2353456456 2353456456
4 The Avengers     124345     124345

In [41]:
### Performing merge if column names are same
colnames(foreign) = c("Name", "foreign")
Final = merge(domestic , foreign , by  = "Name")
head(Final)

  Name         Domestic   foreign
1 Dark Knight     2353454    2353454
2 Hobbit       2353456456 2353456456
3 Skyfall      2353456456 2353456456
4 The Avengers     124345     124345

* Performing *Outer* Merge
1. Direct outer merge
2. Left inner merge
3. Right inner Merge

In [42]:
Final = merge(domestic , foreign , by  = "Name", all = T)
Final

  Name         Domestic   foreign
1 Dark Knight     2353454    2353454
2 Hobbit       2353456456 2353456456
3 Hunger Games    3453534         NA
4 Ice age              NA    3453534
5 Skyfall      2353456456 2353456456
6 The Avengers     124345     124345

In [43]:
Final =merge(domestic , foreign ,by = "Name", all.x = T)
Final
Final =merge(domestic , foreign ,by = "Name", all.y = T)
Final

  Name         Domestic   foreign
1 Dark Knight     2353454    2353454
2 Hobbit       2353456456 2353456456
3 Hunger Games    3453534         NA
4 Skyfall      2353456456 2353456456
5 The Avengers     124345     124345

  Name         Domestic   foreign
1 Dark Knight     2353454    2353454
2 Hobbit       2353456456 2353456456
3 Ice age              NA    3453534
4 Skyfall      2353456456 2353456456
5 The Avengers     124345     124345